#Домашняя работа Урок№1

//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//int a=44;
//int b=5;

//int max=a;
//int min=a;

//if ( a>max ) max=a;
//if ( b>max ) max=b;
//if ( a<min ) min=a;
//if ( b<min ) min=b;

//Console.Write("максимальное из двух чисел - ");
//Console.Write(max);
//Console.Write(" минимальное из двух чисел - ");
//Console.Write(min);

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
//int a=44;
//int b=5;
//int c=78;

//int max=a;

//if ( a>max ) max=a;
//if ( b>max ) max=b;
//if ( c>max ) max=c;

//Console.Write("максимальное из этих чисел - ");
//Console.Write(max);

//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// int a;                             
//Console.Write("введите число: ");
//a= Console.Read();
 
//     if (a % 2==1)
//     {
//         Console.WriteLine("число нечетное");
           
//    }
//     else
//    {
//        Console.WriteLine("Число четное");
//    } 

//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//   Console.Write("Введите число N: ");
//int N = Int32.Parse(Console.ReadLine());
//for (int i=0; i<N; i++)
//if (i%2==0)            
//    Console.WriteLine(i);
